# Задайте список из n чисел последовательности (1+1/n)^n 
# и выведите на экран их сумму

# number = int(input('Введите колличество чисел в списке '))
# s = []

# for i in range(1, number + 1):
#     s.append(round((1 + 1/i) ** i))

# print(f'n = {number}: {s} -> {sum(s)}')

a = 82 // 3 ** 2 % 7
print(a)